Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: Unfortunately this version of Firefox does not support the web technology that powers Firefox Send. You’ll need to update your browser.
ig: Ọ dị nwute na ụdị Firefox a anaghị akwado teknụzụ weebụ na-eji Firefox Zipụ. Ikwesiri imelite ihe nchọgharị gị.

source: Unlock
ig: imeghe

source: Update Firefox
ig: Melite Firefox

source: Version 1.0, dated March 12, 2019
ig: 1.dị 1.0, akara ụbọchị Maachi 12, 2019

source: Why does Firefox Send require JavaScript?
ig: Kedu ihe kpatara Firefox Send jiri chọ JavaScript?

source: Why is my browser not supported?
ig: Gịnị kpatara na akwadoghị ihe nchọgharị m?

source: Your browser is not supported.
ig: Adighi akwado ihe nchogharị gị

source: Your file is encrypted and ready to send
ig: Failu gi zoro ezo ma di njikere iziga
